<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>The Support app is a macOS menu bar app made by Root3</string>
    <key>Identifier</key>
    <string>com.github.ljcacioppo.download.Support</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Support</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>root3nl/SupportApp</string>
                <key>sort_by_highest_tag_names</key>
                <string>True</string>
                <key>asset_regex</key>
                <string>Support.*.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>requirement</key>
                <string>identifier "nl.root3.support"</string>
                <key>strict_verification</key>
                <true />
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Root3 B.V. (98LJ4XBGYK)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>